src/main/resources/xml/mtn-unsubscribe.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:loc="http://www.csapi.org/schema/parlayx/subscribe/manage/v1_0/local">
    <soapenv:Header>
        <tns:RequestSOAPHeader xmlns:tns="http://www.huawei.com.cn/schema/common/v2_1">
            <tns:spId>sp_id</tns:spId>
            <tns:spPassword>sp_password</tns:spPassword>
            <tns:timeStamp>time_stamp</tns:timeStamp>
        </tns:RequestSOAPHeader>
    </soapenv:Header>
    <soapenv:Body>
        <loc:unSubscribeProductRequest>
            <loc:unSubscribeProductReq>
                <userID>
                    <ID>end_user_phone_number</ID>
                    <type>0</type>
                </userID>
                <subInfo>
                    <productID>product_id</productID>
                    <operCode>en</operCode>
                    <isAutoExtend>0</isAutoExtend>
                    <channelID>1</channelID>
                    <extensionInfo>
                        <namedParameters>
                            <key>SubType</key>
                            <value>0</value>
                        </namedParameters>
                    </extensionInfo>
                </subInfo>
            </loc:unSubscribeProductReq>
        </loc:unSubscribeProductRequest>
    </soapenv:Body>
</soapenv:Envelope>
